timesheet-server/app/controllers/api/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "teddy"], ["LIMIT", 1]]
---
    def login
      user = User.find_by(name: params[:name])