timesheet-server/app/controllers/api/timesheets_controller.rb

SELECT "timesheets".* FROM "timesheets"
---
    def index
        render json: Timesheets.all

INSERT INTO "timesheets" ("date", "client", "travel_information", "arrival_time", "departure_time", "products_used", "receipts", "notes", "action_next_visit", "written_by", "created_at", "updated_at", "staff_attendance") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
def create
    puts params[:client]
    timesheets = Timesheets.create(date: params[:date], staff_attendance: params[:staff_attendance], client: params[:client], travel_information: params[:travel_information], arrival_time: params[:arrival_time], departure_time: params[:departure_time], products_used: params[:products_used], receipts: params[:receipts], notes: params[:notes], action_next_visit: params[:action_next_visit], written_by: params[:written_by])

SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
def show
    render json: Timesheets.find(params[:id])

SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "timesheets" SET "date" = $1, "arrival_time" = $2, "departure_time" = $3, "updated_at" = $4 WHERE "timesheets"."id" = $5  [["date", "2021-05-29T12:47:00.000Z"], ["arrival_time", "2021-05-03T08:47:45.310Z"], ["departure_time", "2021-05-03T05:47:45.312Z"], ["updated_at", "2021-05-03 12:47:56.364913"], ["id", 31]]
---
def update
    timesheets = Timesheets.find(params[:id])
    timesheets.update(date: params[:date], staff_attendance: params[:staff_attendance], client: params[:client], travel_information: params[:travel_information], arrival_time: params[:arrival_time], departure_time: params[:departure_time], products_used: params[:products_used], receipts: params[:receipts], notes: params[:notes], action_next_visit: params[:action_next_visit], written_by: params[:written_by])

DELETE FROM "timesheets" WHERE "timesheets"."id" = $1  [["id", 8]]
---
def destroy
    Timesheets.destroy(params[:id])