timesheet-server/app/controllers/api/users_controller.rb

def create
user = User.create(user_params)
---
INSERT INTO "users" ("name", "password_digest") VALUES ($1, $2) RETURNING "id"  [["name", "eden123"], ["password_digest", "$2a$12$1Sb2wYXWqKrtsuz.D5vD7OGqprbTrgfWkNS0gd4upcU/MOyoWGhJC"]]

def update
render json: User.find(params[:id]).update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["name", "eden"], ["password_digest", "$2a$12$uRDc2/V3jHFhT8jzieWb/ubxzSydzGOjampRkkEHgtBwg652/5qve"], ["id", 1]]